pellepl/baremetal/arch/msp/msp430/mdk/include/rf430frl152h_rom.h
/* RF13MCTL Definitions */

/* RF13MINT Control Bits */
#define RF13MRXIFG             (0x0001)       /* RF13M Receive downlink done interrupt flag */
#define RF13MTXIFG             (0x0002)       /* RF13M Uplink transmission done interrupt flag */
#define RF13MRXWMIFG           (0x0004)       /* RF13M RX FIFO high watermark reached interrupt flag */
#define RF13MTXWMIFG           (0x0008)       /* RF13M TX FIFO low watermark reached interrupt flag */
#define RF13MSLIFG             (0x0010)       /* RF13M RX Slot marker interrupt flag */
#define RF13MOUFLIFG           (0x0020)       /* RF13M Over-/Under-flow condition detected */
#define RF13MRXEIFG            (0x0040)       /* RF13M RX Error detected */
#define RF13MRFTOIFG           (0x0080)       /* RF13M RF Timeout detected */
#define RF13MRXIE              (0x0100)       /* RF13M RX done interrupt enable */
#define RF13MTXIE              (0x0200)       /* RF13M TX done interrupt enable */
#define RF13MRXWMIE            (0x0400)       /* RF13M RX FIFO high watermark interrupt enable */
#define RF13MTXWMIE            (0x0800)       /* RF13M TX FIFO low watermark interrupt enable */
#define RF13MSLIE              (0x1000)       /* RF13M ISO15693 Slot marker interrupt enable */
#define RX13MOUFLIE            (0x2000)       /* RF13M Over-/Under-flow interrupt enable */
#define RX13MRXEIE             (0x4000)       /* RF13M RX Error interrupt enable */
#define RX13MRFTOIE            (0x8000)       /* RF13M RF Timeout detected interrupt enable */

/* RF13MINT Control Bits */
#define RF13MRXIFG_L           (0x0001)       /* RF13M Receive downlink done interrupt flag */
#define RF13MTXIFG_L           (0x0002)       /* RF13M Uplink transmission done interrupt flag */
#define RF13MRXWMIFG_L         (0x0004)       /* RF13M RX FIFO high watermark reached interrupt flag */
#define RF13MTXWMIFG_L         (0x0008)       /* RF13M TX FIFO low watermark reached interrupt flag */
#define RF13MSLIFG_L           (0x0010)       /* RF13M RX Slot marker interrupt flag */
#define RF13MOUFLIFG_L         (0x0020)       /* RF13M Over-/Under-flow condition detected */
#define RF13MRXEIFG_L          (0x0040)       /* RF13M RX Error detected */
#define RF13MRFTOIFG_L         (0x0080)       /* RF13M RF Timeout detected */

/* RF13MINT Control Bits */
#define RF13MRXIE_H            (0x0001)       /* RF13M RX done interrupt enable */
#define RF13MTXIE_H            (0x0002)       /* RF13M TX done interrupt enable */
#define RF13MRXWMIE_H          (0x0004)       /* RF13M RX FIFO high watermark interrupt enable */
#define RF13MTXWMIE_H          (0x0008)       /* RF13M TX FIFO low watermark interrupt enable */
#define RF13MSLIE_H            (0x0010)       /* RF13M ISO15693 Slot marker interrupt enable */
#define RX13MOUFLIE_H          (0x0020)       /* RF13M Over-/Under-flow interrupt enable */
#define RX13MRXEIE_H           (0x0040)       /* RF13M RX Error interrupt enable */
#define RX13MRFTOIE_H          (0x0080)       /* RF13M RF Timeout detected interrupt enable */

/* RF13MIV Control Bits */
#define RF13MIV0               (0x0002)       /* RF13M Interrupt vector value bit: 0 */
#define RF13MIV1               (0x0004)       /* RF13M Interrupt vector value bit: 1 */
#define RF13MIV2               (0x0008)       /* RF13M Interrupt vector value bit: 2 */
#define RF13MIV3               (0x0010)       /* RF13M Interrupt vector value bit: 3 */

/* RF13MIV Control Bits */
#define RF13MIV0_L             (0x0002)       /* RF13M Interrupt vector value bit: 0 */
#define RF13MIV1_L             (0x0004)       /* RF13M Interrupt vector value bit: 1 */
#define RF13MIV2_L             (0x0008)       /* RF13M Interrupt vector value bit: 2 */
#define RF13MIV3_L             (0x0010)       /* RF13M Interrupt vector value bit: 3 */

/* RF13MIV Definitions */
#define RF13MIV__NONE          (0x0000)       /* No Interrupt pending */
#define RF13MIV__RX            (0x0002)       /* RF13MRXIFG receive done */
#define RF13MIV__TX            (0x0004)       /* RF13MTXIFG transmit done*/
#define RF13MIV__RXWM          (0x0006)       /* RF13MRXWMIFG RX high water mark */
#define RF13MIV__TXWM          (0x0008)       /* RF13MTXWMIFG TX low watermark */
#define RF13MIV__SL            (0x000A)       /* RF13MSLIFG slotmarker */
#define RF13MIV__OUFL          (0x000C)       /* RF13MOUFLIFG over/underflow */
#define RF13MIV__RXE           (0x000E)       /* RF13MRXEIFG RX error */
#define RF13MIV__RFTO          (0x0010)       /* RF13MRFTOIFG RF timeout error */

/* RF13MRXF Control Bits */

/* RF13MTXF Control Bits */

/* RF13MCRC Control Bits */

/* RF13MFIFOFL Control Bits */

/* RF13MWMCFG Control Bits */

/* RF13MWMCFG Definitions */
#define RF13MRXWM_0            (0x0000)       /* RF13M RX Watermark level: 0  */
#define RF13MRXWM_1            (0x0001)       /* RF13M RX Watermark level: 1  */
#define RF13MRXWM_2            (0x0002)       /* RF13M RX Watermark level: 2  */
#define RF13MRXWM_3            (0x0003)       /* RF13M RX Watermark level: 3  */
#define RF13MRXWM_4            (0x0004)       /* RF13M RX Watermark level: 4  */
#define RF13MRXWM_5            (0x0005)       /* RF13M RX Watermark level: 5  */
#define RF13MRXWM_6            (0x0006)       /* RF13M RX Watermark level: 6  */
#define RF13MRXWM_7            (0x0007)       /* RF13M RX Watermark level: 7  */
#define RF13MRXWM_8            (0x0008)       /* RF13M RX Watermark level: 8  */
#define RF13MRXWM_9            (0x0009)       /* RF13M RX Watermark level: 9  */
#define RF13MRXWM_10           (0x000A)       /* RF13M RX Watermark level: 10 */
#define RF13MRXWM_11           (0x000B)       /* RF13M RX Watermark level: 11 */
#define RF13MRXWM_12           (0x000C)       /* RF13M RX Watermark level: 12 */
#define RF13MRXWM_13           (0x000D)       /* RF13M RX Watermark level: 13 */
#define RF13MRXWM_14           (0x000E)       /* RF13M RX Watermark level: 14 */
#define RF13MRXWM_15           (0x000F)       /* RF13M RX Watermark level: 15 */
#define RF13MRXWM_16           (0x0010)       /* RF13M RX Watermark level: 16 */
#define RF13MRXWM_17           (0x0011)       /* RF13M RX Watermark level: 17 */
#define RF13MRXWM_18           (0x0012)       /* RF13M RX Watermark level: 18 */
#define RF13MRXWM_19           (0x0013)       /* RF13M RX Watermark level: 19 */
#define RF13MRXWM_20           (0x0014)       /* RF13M RX Watermark level: 20 */
#define RF13MRXWM_21           (0x0015)       /* RF13M RX Watermark level: 21 */
#define RF13MRXWM_22           (0x0016)       /* RF13M RX Watermark level: 22 */
#define RF13MRXWM_23           (0x0017)       /* RF13M RX Watermark level: 23 */
#define RF13MRXWM_24           (0x0018)       /* RF13M RX Watermark level: 24 */
#define RF13MRXWM_25           (0x0019)       /* RF13M RX Watermark level: 25 */
#define RF13MRXWM_26           (0x001A)       /* RF13M RX Watermark level: 26 */
#define RF13MRXWM_27           (0x001B)       /* RF13M RX Watermark level: 27 */
#define RF13MRXWM_28           (0x001C)       /* RF13M RX Watermark level: 28 */
#define RF13MRXWM_29           (0x001D)       /* RF13M RX Watermark level: 29 */
#define RF13MRXWM_30           (0x001E)       /* RF13M RX Watermark level: 30 */
#define RF13MRXWM_31           (0x001F)       /* RF13M RX Watermark level: 31 */

#define RF13MTXWM_0            (0x0000)       /* RF13M TX Watermark level: 0  */
#define RF13MTXWM_1            (0x0100)       /* RF13M TX Watermark level: 1  */
#define RF13MTXWM_2            (0x0200)       /* RF13M TX Watermark level: 2  */
#define RF13MTXWM_3            (0x0300)       /* RF13M TX Watermark level: 3  */
#define RF13MTXWM_4            (0x0400)       /* RF13M TX Watermark level: 4  */
#define RF13MTXWM_5            (0x0500)       /* RF13M TX Watermark level: 5  */
#define RF13MTXWM_6            (0x0600)       /* RF13M TX Watermark level: 6  */
#define RF13MTXWM_7            (0x0700)       /* RF13M TX Watermark level: 7  */
#define RF13MTXWM_8            (0x0800)       /* RF13M TX Watermark level: 8  */
#define RF13MTXWM_9            (0x0900)       /* RF13M TX Watermark level: 9  */
#define RF13MTXWM_10           (0x0A00)       /* RF13M TX Watermark level: 10 */
#define RF13MTXWM_11           (0x0B00)       /* RF13M TX Watermark level: 11 */
#define RF13MTXWM_12           (0x0C00)       /* RF13M TX Watermark level: 12 */
#define RF13MTXWM_13           (0x0D00)       /* RF13M TX Watermark level: 13 */
#define RF13MTXWM_14           (0x0E00)       /* RF13M TX Watermark level: 14 */
#define RF13MTXWM_15           (0x0F00)       /* RF13M TX Watermark level: 15 */
#define RF13MTXWM_16           (0x1000)       /* RF13M TX Watermark level: 16 */
#define RF13MTXWM_17           (0x1100)       /* RF13M TX Watermark level: 17 */
#define RF13MTXWM_18           (0x1200)       /* RF13M TX Watermark level: 18 */
#define RF13MTXWM_19           (0x1300)       /* RF13M TX Watermark level: 19 */
#define RF13MTXWM_20           (0x1400)       /* RF13M TX Watermark level: 20 */
#define RF13MTXWM_21           (0x1500)       /* RF13M TX Watermark level: 21 */
#define RF13MTXWM_22           (0x1600)       /* RF13M TX Watermark level: 22 */
#define RF13MTXWM_23           (0x1700)       /* RF13M TX Watermark level: 23 */
#define RF13MTXWM_24           (0x1800)       /* RF13M TX Watermark level: 24 */
#define RF13MTXWM_25           (0x1900)       /* RF13M TX Watermark level: 25 */
#define RF13MTXWM_26           (0x1A00)       /* RF13M TX Watermark level: 26 */
#define RF13MTXWM_27           (0x1B00)       /* RF13M TX Watermark level: 27 */
#define RF13MTXWM_28           (0x1C00)       /* RF13M TX Watermark level: 28 */
#define RF13MTXWM_29           (0x1D00)       /* RF13M TX Watermark level: 29 */
#define RF13MTXWM_30           (0x1E00)       /* RF13M TX Watermark level: 30 */
#define RF13MTXWM_31           (0x1F00)       /* RF13M TX Watermark level: 31 */

/************************************************************
* SD14 (14 Bit sigma delta ADC)
************************************************************/
#define __MSP430_HAS_SD14__                   /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_SD14__ 0x0700
#define SD14_BASE              __MSP430_BASEADDRESS_SD14__

sfr_w(SD14CTL0);                              /* SD14 Control Register 0 */
sfr_b(SD14CTL0_L);                            /* SD14 Control Register 0 */
sfr_b(SD14CTL0_H);                            /* SD14 Control Register 0 */
sfr_w(SD14CTL1);                              /* SD14 Control Register 1 */
sfr_b(SD14CTL1_L);                            /* SD14 Control Register 1 */
sfr_b(SD14CTL1_H);                            /* SD14 Control Register 1 */
sfr_w(SD14MEM0);                              /* SD14 Conversion Result */
sfr_b(SD14MEM0_L);                            /* SD14 Conversion Result */
sfr_b(SD14MEM0_H);                            /* SD14 Conversion Result */
sfr_w(SD14MEM1);                              /* SD14 Intermediate Conversion Result */
sfr_b(SD14MEM1_L);                            /* SD14 Intermediate Conversion Result */
sfr_b(SD14MEM1_H);                            /* SD14 Intermediate Conversion Result */
sfr_w(SD14MEM2);                              /* SD14 Intermediate Conversion Result */
sfr_b(SD14MEM2_L);                            /* SD14 Intermediate Conversion Result */
sfr_b(SD14MEM2_H);                            /* SD14 Intermediate Conversion Result */
sfr_w(SD14MEM3);                              /* SD14 Intermediate Conversion Result */
sfr_b(SD14MEM3_L);                            /* SD14 Intermediate Conversion Result */
sfr_b(SD14MEM3_H);                            /* SD14 Intermediate Conversion Result */
sfr_w(SD14IV);                                /* SD14 Interrupt Vector */
sfr_b(SD14IV_L);                              /* SD14 Interrupt Vector */
sfr_b(SD14IV_H);                              /* SD14 Interrupt Vector */

