pellepl/baremetal/arch/msp/msp430/mdk/include/rf430frl152h_rom.h
/* SD14CTL0 Control Bits */
#define SD14EN                 (0x0001)       /* SD14 Module enable */
#define SD14SC                 (0x0004)       /* SD14 Enable transmission of uplink */
#define SD14SGL                (0x0008)       /* SD14 Conversion mode select */
#define SD14SSEL0              (0x0010)       /* SD14 Sigma-Delta Clock source Bit: 0 */
#define SD14SSEL1              (0x0020)       /* SD14 Sigma-Delta Clock source Bit: 1 */
#define SD14DIV0               (0x0040)       /* SD14 Sigma-Delta Clock divider Bit: 0 */
#define SD14DIV1               (0x0080)       /* SD14 Sigma-Delta Clock divider Bit: 1 */
#define SD14IE                 (0x0100)       /* SD14 interrupt enable */
#define SD14IFG                (0x0200)       /* SD14 interrupt flag */
#define SD14OVIE               (0x0400)       /* SD14 overflow interrupt enable */
#define SD14OVIFG              (0x0800)       /* SD14 overflow interrupt flag */
#define VIRTGND                (0x1000)       /* Defines virtual ground */

/* SD14CTL0 Control Bits */
#define SD14EN_L               (0x0001)       /* SD14 Module enable */
#define SD14SC_L               (0x0004)       /* SD14 Enable transmission of uplink */
#define SD14SGL_L              (0x0008)       /* SD14 Conversion mode select */
#define SD14SSEL0_L            (0x0010)       /* SD14 Sigma-Delta Clock source Bit: 0 */
#define SD14SSEL1_L            (0x0020)       /* SD14 Sigma-Delta Clock source Bit: 1 */
#define SD14DIV0_L             (0x0040)       /* SD14 Sigma-Delta Clock divider Bit: 0 */
#define SD14DIV1_L             (0x0080)       /* SD14 Sigma-Delta Clock divider Bit: 1 */

/* SD14CTL0 Control Bits */
#define SD14IE_H               (0x0001)       /* SD14 interrupt enable */
#define SD14IFG_H              (0x0002)       /* SD14 interrupt flag */
#define SD14OVIE_H             (0x0004)       /* SD14 overflow interrupt enable */
#define SD14OVIFG_H            (0x0008)       /* SD14 overflow interrupt flag */
#define VIRTGND_H              (0x0010)       /* Defines virtual ground */

/* SD14CTL0 Definitions */
#define SD14SSEL_0             (0x0000)       /* SD14 Sigma-Delta Clock select: 0 */
#define SD14SSEL_1             (0x0010)       /* SD14 Sigma-Delta Clock select: 1 */
#define SD14SSEL_2             (0x0020)       /* SD14 Sigma-Delta Clock select: 2 */
#define SD14SSEL_3             (0x0030)       /* SD14 Sigma-Delta Clock select: 3 */
#define SD14SSEL__ACLK         (0x0000)       /* SD14 Sigma-Delta Clock select: ACLK */
#define SD14SSEL__SMCLK        (0x0010)       /* SD14 Sigma-Delta Clock select: SMCLK */
#define SD14SSEL__MCLK         (0x0020)       /* SD14 Sigma-Delta Clock select: MCLK */
#define SD14SSEL__VLOCLK       (0x0030)       /* SD14 Sigma-Delta Clock select: VLOCLK */
#define SD14DIV_0              (0x0000)       /* SD14 Sigma-Delta Clock divider select: 0 */
#define SD14DIV_1              (0x0040)       /* SD14 Sigma-Delta Clock divider select: 1 */
#define SD14DIV_2              (0x0080)       /* SD14 Sigma-Delta Clock divider select: 2 */
#define SD14DIV_3              (0x00C0)       /* SD14 Sigma-Delta Clock divider select: 3 */
#define SD14DIV__8             (0x0000)       /* SD14 Sigma-Delta Clock divider select: 8 */
#define SD14DIV__16            (0x0040)       /* SD14 Sigma-Delta Clock divider select: 16 */
#define SD14DIV__32            (0x0080)       /* SD14 Sigma-Delta Clock divider select: 32 */
#define SD14DIV__64            (0x00C0)       /* SD14 Sigma-Delta Clock divider select: 64 */

/* SD14CTL1 Control Bits */
#define SD14INCH0              (0x0001)       /* SD14 channel input selection Bit: 0 */
#define SD14INCH1              (0x0002)       /* SD14 channel input selection Bit: 1 */
#define SD14INCH2              (0x0004)       /* SD14 channel input selection Bit: 2 */
#define SD14GAIN0              (0x0008)       /* SD14 preamplifier gain Bit: 0 */
#define SD14GAIN1              (0x0010)       /* SD14 preamplifier gain Bit: 1 */
#define SD14INTDLY0            (0x0040)       /* SD14 Interrupt delay Bit: 0 */
#define SD14INTDLY1            (0x0080)       /* SD14 Interrupt delay Bit: 1 */
#define SD14FILT               (0x0100)       /* SD14 digital filter selection */
#define SD14RATE0              (0x0200)       /* SD14 rate change factor selection Bit: 0 */
#define SD14RATE1              (0x0400)       /* SD14 rate change factor selection Bit: 1 */
#define SD14RATE2              (0x0800)       /* SD14 rate change factor selection Bit: 2 */
#define SD14UNI                (0x1000)       /* SD14 Unipolar format enable Bit: 0 */
#define SD14TC                 (0x2000)       /* SD14 Two's complement format enable Bit: 0 */
#define SD14RBEN0              (0x4000)       /* SD14 Resistive bias on TEMP1 enable */
#define SD14RBEN1              (0x8000)       /* SD14 Resistive bias on TEMP2 enable */

/* SD14CTL1 Control Bits */
#define SD14INCH0_L            (0x0001)       /* SD14 channel input selection Bit: 0 */
#define SD14INCH1_L            (0x0002)       /* SD14 channel input selection Bit: 1 */
#define SD14INCH2_L            (0x0004)       /* SD14 channel input selection Bit: 2 */
#define SD14GAIN0_L            (0x0008)       /* SD14 preamplifier gain Bit: 0 */
#define SD14GAIN1_L            (0x0010)       /* SD14 preamplifier gain Bit: 1 */
#define SD14INTDLY0_L          (0x0040)       /* SD14 Interrupt delay Bit: 0 */
#define SD14INTDLY1_L          (0x0080)       /* SD14 Interrupt delay Bit: 1 */

/* SD14CTL1 Control Bits */
#define SD14FILT_H             (0x0001)       /* SD14 digital filter selection */
#define SD14RATE0_H            (0x0002)       /* SD14 rate change factor selection Bit: 0 */
#define SD14RATE1_H            (0x0004)       /* SD14 rate change factor selection Bit: 1 */
#define SD14RATE2_H            (0x0008)       /* SD14 rate change factor selection Bit: 2 */
#define SD14UNI_H              (0x0010)       /* SD14 Unipolar format enable Bit: 0 */
#define SD14TC_H               (0x0020)       /* SD14 Two's complement format enable Bit: 0 */
#define SD14RBEN0_H            (0x0040)       /* SD14 Resistive bias on TEMP1 enable */
#define SD14RBEN1_H            (0x0080)       /* SD14 Resistive bias on TEMP2 enable */

/* SD14CTL1 Definitions */
#define SD14INCH_0             (0x0000)       /* SD14 channel input select: 0 */
#define SD14INCH_1             (0x0001)       /* SD14 channel input select: 1 */
#define SD14INCH_2             (0x0002)       /* SD14 channel input select: 2 */
#define SD14INCH_3             (0x0003)       /* SD14 channel input select: 3 */
#define SD14INCH_4             (0x0004)       /* SD14 channel input select: 4 */
#define SD14INCH_5             (0x0005)       /* SD14 channel input select: 5 */
#define SD14INCH_6             (0x0006)       /* SD14 channel input select: 6 */
#define SD14INCH_7             (0x0007)       /* SD14 channel input select: 7 */
#define SD14INCH__A0           (0x0000)       /* SD14 channel input select: 0 */
#define SD14INCH__A1           (0x0001)       /* SD14 channel input select: 1 */
#define SD14INCH__A2           (0x0002)       /* SD14 channel input select: 2 */
#define SD14INCH__A3           (0x0003)       /* SD14 channel input select: 3 */
#define SD14INCH__A4           (0x0004)       /* SD14 channel input select: 4 */
#define SD14INCH__A5           (0x0005)       /* SD14 channel input select: 5 */
#define SD14INCH__A6           (0x0006)       /* SD14 channel input select: 6 */
#define SD14INCH__A7           (0x0007)       /* SD14 channel input select: 7 */
#define SD14INCH__ADC0         (0x0000)       /* SD14 channel input select: GS-CNTR Electrode */
#define SD14INCH__TEMP         (0x0001)       /* SD14 channel input select: Internal Temp Sensor */
#define SD14INCH__INTTEMP      (0x0001)       /* SD14 channel input select: Internal Temp Sensor */
#define SD14INCH__ADC2         (0x0002)       /* SD14 channel input select: Thermistor/Temp2 */
#define SD14INCH__TEMP2        (0x0002)       /* SD14 channel input select: Thermistor/Temp2 */
#define SD14INCH__ADC1         (0x0003)       /* SD14 channel input select: Reference Resistor/Temp1 */
#define SD14INCH__TEMP1        (0x0003)       /* SD14 channel input select: Reference Resistor/Temp1 */
#define SD14INCH__SHORT        (0x0007)       /* SD14 channel input select: Shorted */
#define SD14INCH__SVSS         (0x0007)       /* SD14 channel input select: Shorted */
#define SD14GAIN_0             (0x0000)       /* SD14 preamplifier gain select: 0 */
#define SD14GAIN_1             (0x0008)       /* SD14 preamplifier gain select: 1 */
#define SD14GAIN_2             (0x0010)       /* SD14 preamplifier gain select: 2 */
#define SD14GAIN_3             (0x0018)       /* SD14 preamplifier gain select: 3 */
#define SD14GAIN__1            (0x0000)       /* SD14 preamplifier gain select: 1x */
#define SD14GAIN__2            (0x0008)       /* SD14 preamplifier gain select: 2x */
#define SD14GAIN__4            (0x0010)       /* SD14 preamplifier gain select: 4x */
#define SD14GAIN__8            (0x0018)       /* SD14 preamplifier gain select: 8x */
#define SD14INTDLY_0           (0x0000)       /* SD14 Interrupt delay select: 0 */
#define SD14INTDLY_1           (0x0040)       /* SD14 Interrupt delay select: 1 */
#define SD14INTDLY_2           (0x0080)       /* SD14 Interrupt delay select: 2 */
#define SD14INTDLY_3           (0x00C0)       /* SD14 Interrupt delay select: 3 */
#define SD14INTDLY__1st        (0x0000)       /* SD14 Interrupt delay select: Int after 1st */
#define SD14INTDLY__2nd        (0x0040)       /* SD14 Interrupt delay select: Int after 2nd */
#define SD14INTDLY__3rd        (0x0080)       /* SD14 Interrupt delay select: Int after 3rd */
#define SD14INTDLY__4th        (0x00C0)       /* SD14 Interrupt delay select: Int after 4th */
#define SD14FILT__CIC          (0x0000)       /* SD14 filter select CIC */
#define SD14FILT__AVG          (0x0100)       /* SD14 filter select moving average */
#define SD14RATE_0             (0x0000)       /* SD14 rate change factor: 0 */
#define SD14RATE_1             (0x0200)       /* SD14 rate change factor: 1 */
#define SD14RATE_2             (0x0400)       /* SD14 rate change factor: 2 */
#define SD14RATE_3             (0x0600)       /* SD14 rate change factor: 3 */
#define SD14RATE_4             (0x0800)       /* SD14 rate change factor: 4 */
#define SD14RATE_5             (0x0A00)       /* SD14 rate change factor: 5 */
#define SD14RATE_6             (0x0C00)       /* SD14 rate change factor: 6 */
#define SD14RATE_7             (0x0E00)       /* SD14 rate change factor: 7 */
#define SD14RATE__CIC32        (0x0000)       /* SD14 rate change factor CIC 32 */
#define SD14RATE__CIC64        (0x0200)       /* SD14 rate change factor CIC 64 */
#define SD14RATE__CIC128       (0x0400)       /* SD14 rate change factor CIC 128 */
#define SD14RATE__CIC256       (0x0600)       /* SD14 rate change factor CIC 256 */
#define SD14RATE__CIC512       (0x0800)       /* SD14 rate change factor CIC 512 */
#define SD14RATE__CIC1024      (0x0A00)       /* SD14 rate change factor CIC 1024 */
#define SD14RATE__CIC2048      (0x0C00)       /* SD14 rate change factor CIC 2048 */
#define SD14RATE__AVG4096      (0x0000)       /* SD14 rate change factor AVG 4096 */
#define SD14RATE__AVG8192      (0x0200)       /* SD14 rate change factor AVG 8192 */
#define SD14RATE__AVG16384     (0x0400)       /* SD14 rate change factor AVG 16384 */
#define SD14RATE__AVG32768     (0x0600)       /* SD14 rate change factor AVG 32768 */

/* SD14IV Control Bits */
#define SD14IV0                (0x0002)       /* SD14IV Interrupt vector value bit: 0 */
#define SD14IV1                (0x0004)       /* SD14IV Interrupt vector value bit: 1 */

/* SD14IV Control Bits */
#define SD14IV0_L              (0x0002)       /* SD14IV Interrupt vector value bit: 0 */
#define SD14IV1_L              (0x0004)       /* SD14IV Interrupt vector value bit: 1 */

/* SD14IV Definitions */
#define SD14IV__NONE           (0x0000)       /* No Interrupt pending */
#define SD14IV__OV             (0x0002)       /* SD14OVIFG overflow */
#define SD14IV__RES            (0x0004)       /* SD14IFG new result*/

/************************************************************
* USCI B0
************************************************************/
#define __MSP430_HAS_EUSCI_B0__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_EUSCI_B0__ 0x0640
#define EUSCI_B0_BASE          __MSP430_BASEADDRESS_EUSCI_B0__


sfr_w(UCB0CTLW0);                             /* USCI B0 Control Word Register 0 */
sfr_b(UCB0CTLW0_L);                           /* USCI B0 Control Word Register 0 */
sfr_b(UCB0CTLW0_H);                           /* USCI B0 Control Word Register 0 */
#define UCB0CTL1               UCB0CTLW0_L    /* USCI B0 Control Register 1 */
#define UCB0CTL0               UCB0CTLW0_H    /* USCI B0 Control Register 0 */
sfr_w(UCB0CTLW1);                             /* USCI B0 Control Word Register 1 */
sfr_b(UCB0CTLW1_L);                           /* USCI B0 Control Word Register 1 */
sfr_b(UCB0CTLW1_H);                           /* USCI B0 Control Word Register 1 */
sfr_w(UCB0BRW);                               /* USCI B0 Baud Word Rate 0 */
sfr_b(UCB0BRW_L);                             /* USCI B0 Baud Word Rate 0 */
sfr_b(UCB0BRW_H);                             /* USCI B0 Baud Word Rate 0 */
#define UCB0BR0                UCB0BRW_L      /* USCI B0 Baud Rate 0 */
#define UCB0BR1                UCB0BRW_H      /* USCI B0 Baud Rate 1 */
sfr_w(UCB0STATW);                             /* USCI B0 Status Word Register */
sfr_b(UCB0STATW_L);                           /* USCI B0 Status Word Register */
sfr_b(UCB0STATW_H);                           /* USCI B0 Status Word Register */
#define UCB0STAT               UCB0STATW_L    /* USCI B0 Status Register */
#define UCB0BCNT               UCB0STATW_H    /* USCI B0 Byte Counter Register */
sfr_w(UCB0TBCNT);                             /* USCI B0 Byte Counter Threshold Register */
sfr_b(UCB0TBCNT_L);                           /* USCI B0 Byte Counter Threshold Register */
sfr_b(UCB0TBCNT_H);                           /* USCI B0 Byte Counter Threshold Register */
sfr_w(UCB0RXBUF);                             /* USCI B0 Receive Buffer */
sfr_b(UCB0RXBUF_L);                           /* USCI B0 Receive Buffer */
sfr_b(UCB0RXBUF_H);                           /* USCI B0 Receive Buffer */
sfr_w(UCB0TXBUF);                             /* USCI B0 Transmit Buffer */
sfr_b(UCB0TXBUF_L);                           /* USCI B0 Transmit Buffer */
sfr_b(UCB0TXBUF_H);                           /* USCI B0 Transmit Buffer */
sfr_w(UCB0I2COA0);                            /* USCI B0 I2C Own Address 0 */
sfr_b(UCB0I2COA0_L);                          /* USCI B0 I2C Own Address 0 */
sfr_b(UCB0I2COA0_H);                          /* USCI B0 I2C Own Address 0 */
sfr_w(UCB0I2COA1);                            /* USCI B0 I2C Own Address 1 */
sfr_b(UCB0I2COA1_L);                          /* USCI B0 I2C Own Address 1 */
sfr_b(UCB0I2COA1_H);                          /* USCI B0 I2C Own Address 1 */
sfr_w(UCB0I2COA2);                            /* USCI B0 I2C Own Address 2 */
sfr_b(UCB0I2COA2_L);                          /* USCI B0 I2C Own Address 2 */
sfr_b(UCB0I2COA2_H);                          /* USCI B0 I2C Own Address 2 */
sfr_w(UCB0I2COA3);                            /* USCI B0 I2C Own Address 3 */
sfr_b(UCB0I2COA3_L);                          /* USCI B0 I2C Own Address 3 */
sfr_b(UCB0I2COA3_H);                          /* USCI B0 I2C Own Address 3 */
sfr_w(UCB0ADDRX);                             /* USCI B0 Received Address Register */
sfr_b(UCB0ADDRX_L);                           /* USCI B0 Received Address Register */
sfr_b(UCB0ADDRX_H);                           /* USCI B0 Received Address Register */
sfr_w(UCB0ADDMASK);                           /* USCI B0 Address Mask Register */
sfr_b(UCB0ADDMASK_L);                         /* USCI B0 Address Mask Register */
sfr_b(UCB0ADDMASK_H);                         /* USCI B0 Address Mask Register */
sfr_w(UCB0I2CSA);                             /* USCI B0 I2C Slave Address */
sfr_b(UCB0I2CSA_L);                           /* USCI B0 I2C Slave Address */
sfr_b(UCB0I2CSA_H);                           /* USCI B0 I2C Slave Address */
sfr_w(UCB0IE);                                /* USCI B0 Interrupt Enable Register */
sfr_b(UCB0IE_L);                              /* USCI B0 Interrupt Enable Register */
sfr_b(UCB0IE_H);                              /* USCI B0 Interrupt Enable Register */
sfr_w(UCB0IFG);                               /* USCI B0 Interrupt Flags Register */
sfr_b(UCB0IFG_L);                             /* USCI B0 Interrupt Flags Register */
sfr_b(UCB0IFG_H);                             /* USCI B0 Interrupt Flags Register */
sfr_w(UCB0IV);                                /* USCI B0 Interrupt Vector Register */

